Repository: aljaroudi/Lingko
Catalog: apple/Lingko/Localizable.xcstrings
Source language: en
Languages: ar, de, es, ru, zh_hans

source: %lld languages
ar: %lld لغة
de: %lld Sprachen
es: %lld idiomas
ru: %lld языков
zh_hans: %lld 种语言

source: 100% On-Device
ar: معالجة على الجهاز بنسبة 100%
de: 100% auf dem Gerät
es: 100% en el dispositivo
ru: 100% на устройстве
zh_hans: 100% 本地处理

source: About
ar: حول
de: Über
es: Acerca de
ru: О приложении
zh_hans: 关于

source: Accessibility
ar: إمكانية الوصول
de: Barrierefreiheit
es: Accesibilidad
ru: Универсальный доступ
zh_hans: 辅助功能

source: Add to favorites
ar: تفضيل
de: Zu Favoriten hinzufügen
es: Añadir a favoritos
ru: Добавить в избранное
zh_hans: 添加到收藏

source: AI Insights
ar: تحليلات الذكاء الاصطناعي
de: KI-Einblicke
es: Insights de IA
ru: Аналитика ИИ
zh_hans: AI 见解

source: All Tags
ar: كل التصنيفات
de: Alle Tags
es: Todas las etiquetas
ru: Все теги
zh_hans: 所有标签

source: All translations and data processing happen entirely on your device. No data is ever sent to external servers.
ar: جميع الترجمات تُعالَج بالكامل على جهازك. لا تُرسَل أي بيانات إلى جهات خارجية.
de: Alle Übersetzungen und Datenverarbeitung erfolgen vollständig auf Ihrem Gerät. Es werden niemals Daten an externe Server gesendet.
es: Todas las traducciones y el procesamiento de datos ocurren completamente en tu dispositivo. Nunca se envía ningún dato a servidores externos.
ru: Все переводы и обработка данных выполняются полностью на вашем устройстве. Данные никогда не отправляются на внешние серверы.
zh_hans: 所有翻译和数据处理完全在您的设备上进行。不会发送任何数据到外部服务器。

source: Alternative Translations
ar: ترجمات بديلة
de: Alternative Übersetzungen
es: Traducciones alternativas
ru: Альтернативные переводы
zh_hans: 备选翻译

source: Analyzing...
ar: يجري التحليل…
de: Analysiere...
es: Analizando...
ru: Анализ…
zh_hans: 分析中...

source: Are you sure you want to delete '%@'? This will remove the tag from all translations.
ar: متأكد من حذف "%@"؟ سيزيل ذلك التصنيف من جميع الترجمات.
de: Möchten Sie '%@' wirklich löschen? Dies entfernt das Tag aus allen Übersetzungen.
es: ¿Estás seguro de que quieres eliminar '%@'? Esto eliminará la etiqueta de todas las traducciones.
ru: Удалить «%@»? Тег будет удалён из всех переводов.
zh_hans: 确定要删除“%@”吗？这将从所有翻译中移除该标签。

source: Are you sure you want to delete all translation history? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف سجل الترجمة بالكامل؟ لا يمكن التراجع عن هذا الإجراء.
de: Möchten Sie wirklich den gesamten Übersetzungsverlauf löschen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar todo el historial de traducciones? Esta acción no se puede deshacer.
ru: Удалить всю историю переводов? Это действие нельзя отменить.
zh_hans: 确定要删除所有翻译历史吗？此操作无法撤销。

source: At least two languages must remain enabled.
ar: يجب تفعيل لغتين على الأقل
de: Mindestens zwei Sprachen müssen aktiviert bleiben.
es: Se deben mantener activados al menos dos idiomas.
ru: Должно быть включено как минимум два языка.
zh_hans: 必须至少启用两种语言。

source: Audio
ar: الصوت
ru: Аудио
zh_hans: 音频

source: Auto
ar: تلقائي
de: Automatisch
es: Automático
ru: Авто
zh_hans: 自动

source: Auto-save Translations
ar: حفظ الترجمات الجديدة
de: Übersetzungen automatisch speichern
es: Guardar traducciones automáticamente
ru: Автосохранение переводов
zh_hans: 自动保存翻译

source: Available
ar: متاح
de: Verfügbar
es: Disponible
ru: Доступно
zh_hans: 可用

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
ru: Отмена
zh_hans: 取消

source: Clear All
ar: مسح الكل
de: Alle löschen
es: Limpiar todo
ru: Очистить всё
zh_hans: 清除全部

source: Clear All History
ar: مسح السجل
de: Gesamten Verlauf löschen
es: Limpiar todo el historial
ru: Очистить всю историю
zh_hans: 清除所有历史

source: Color
ar: اللون
de: Farbe
ru: Цвет
zh_hans: 颜色

source: Configure default behavior for translations
ar: تكوين السلوك الافتراضي للترجمات
de: Standardverhalten für Übersetzungen konfigurieren
es: Configurar el comportamiento predeterminado para las traducciones
ru: Настройка поведения переводов по умолчанию
zh_hans: 配置翻译的默认行为

source: Copied
ar: نُسِخ
de: Kopiert
es: Copiado
ru: Скопировано
zh_hans: 已复制

source: Copy translation
ar: نسخ الترجمة
de: Übersetzung kopieren
es: Copiar traducción
ru: Копировать перевод
zh_hans: 复制翻译

source: Create
ar: إنشاء
de: Erstellen
es: Crear
ru: Создать
zh_hans: 创建

source: Create Tag
ar: إنشاء تصنيف
de: Tag erstellen
es: Crear etiqueta
ru: Создать тег
zh_hans: 创建标签

source: Create tags in Tag Management to organize your translations
ar: أنشئ تصنيفات في إدارة التصنيفات لتنظيم ترجماتك
de: Erstellen Sie Tags in der Tag-Verwaltung, um Ihre Übersetzungen zu organisieren
es: Crea etiquetas en Gestión de etiquetas para organizar tus traducciones
ru: Создавайте теги в разделе управления тегами для организации переводов
zh_hans: 在标签管理中创建标签以组织您的翻译

source: Create tags to organize your translation history
ar: أنشئ تصنيفات لتنظيم سجل الترجمة الخاص بك
de: Erstellen Sie Tags, um Ihren Übersetzungsverlauf zu organisieren
es: Crea etiquetas para organizar tu historial de traducciones
ru: Создавайте теги для организации истории переводов
zh_hans: 创建标签以组织您的翻译历史

source: Cultural Context
ar: السياق الثقافي
de: Kultureller Kontext
es: Contexto cultural
ru: Культурный контекст
zh_hans: 文化背景

source: Customize accessibility features
ar: تخصيص ميزات إمكانية الوصول
de: Barrierefreiheitsfunktionen anpassen
es: Personalizar funciones de accesibilidad
ru: Настройка функций универсального доступа
zh_hans: 自定义辅助功能

source: Default speed for text-to-speech playback
ar: السرعة الافتراضية لتشغيل نطق النص
de: Standardgeschwindigkeit für Text-zu-Sprache-Wiedergabe
es: Velocidad predeterminada para la reproducción de texto a voz
ru: Скорость воспроизведения речи по умолчанию
zh_hans: 文字转语音播放的默认速度

source: Delete
ar: حذف
de: Löschen
es: Eliminar
ru: Удалить
zh_hans: 删除

source: Delete Tag
ar: حذف التصنيف
de: Tag löschen
es: Eliminar etiqueta
ru: Удалить тег
zh_hans: 删除标签

source: Details
ar: التفاصيل
es: Detalles
ru: Подробности
zh_hans: 详情

source: Developer Website
ar: موقع المطور
de: Entwickler-Website
es: Sitio web del desarrollador
ru: Сайт разработчика
zh_hans: 开发者网站

source: Done
ar: تم
de: Fertig
es: Hecho
ru: Готово
zh_hans: 完成

source: Download
ar: تنزيل
de: Herunterladen
es: Descargar
ru: Скачать
zh_hans: 下载

source: Download at least 2 languages to start translating
ar: حمّل لغتين على الأقل لبدء الترجمة
de: Laden Sie mindestens 2 Sprachen herunter, um mit der Übersetzung zu beginnen
es: Descarga al menos 2 idiomas para comenzar a traducir
ru: Скачайте как минимум 2 языка, чтобы начать перевод
zh_hans: 至少下载 2 种语言以开始翻译

source: Download Languages
ar: تنزيل اللغات
de: Sprachen herunterladen
es: Descargar idiomas
ru: Скачать языки
zh_hans: 下载语言

source: Download More Languages
ar: تنزيل المزيد من اللغات
de: Weitere Sprachen herunterladen
es: Descargar más idiomas
ru: Скачать ещё языки
zh_hans: 下载更多语言

source: Edit Tags
ar: تعديل التصنيفات
de: Tags bearbeiten
es: Editar etiquetas
ru: Изменить теги
zh_hans: 编辑标签

source: Enter tag name
ar: أدخل اسم التصنيف
de: Tag-Name eingeben
es: Ingresa el nombre de la etiqueta
ru: Введите название тега
zh_hans: 输入标签名称

source: Enter text
ar: أدخل النص
de: Text eingeben
es: Ingresa texto
ru: Введите текст
zh_hans: 输入文本

source: Enter text above to translate into multiple languages simultaneously
ar: أدخل النص أعلاه للترجمة إلى لغات متعددة في وقت واحد
de: Geben Sie oben Text ein, um gleichzeitig in mehrere Sprachen zu übersetzen
es: Ingresa texto arriba para traducir a varios idiomas simultáneamente
ru: Введите текст выше для одновременного перевода на несколько языков
zh_hans: 在上方输入文本以同时翻译成多种语言

source: Example Sentences
ar: جمل أمثلة
de: Beispielsätze
es: Oraciones de ejemplo
ru: Примеры предложений
zh_hans: 例句

source: Favorite
ar: التفضيل
de: Favorit
es: Favorito
ru: Избранное
zh_hans: 收藏

source: Favorites Only
ar: المفضلات فقط
de: Nur Favoriten
es: Solo favoritos
ru: Только избранное
zh_hans: 仅收藏

source: Haptic Feedback
ar: الاهتزازات التفاعلية
de: Haptisches Feedback
es: Retroalimentación háptica
ru: Тактильный отклик
zh_hans: 触感反馈

source: History
ar: السجل
de: Verlauf
es: Historial
ru: История
zh_hans: 历史

source: Icon
ar: الأيقونة
de: Symbol
es: Icono
ru: Значок
zh_hans: 图标

source: Image Translation
ar: ترجمة الصور
de: Bildübersetzung
es: Traducción de imágenes
ru: Перевод с изображения
zh_hans: 图像翻译

source: Import Image
ar: استيراد صورة
de: Bild importieren
es: Importar imagen
ru: Импортировать изображение
zh_hans: 导入图像

source: Installed
ar: مثبّت
de: Installiert
es: Instalado
ru: Установлено
zh_hans: 已安装

source: Language Management
ar: إدارة اللغات
de: Sprachverwaltung
es: Gestión de idiomas
ru: Управление языками
zh_hans: 语言管理

source: Languages
ar: اللغات
de: Sprachen
es: Idiomas
ru: Языки
zh_hans: 语言

source: Launch at Login
ar: التشغيل عند تسجيل الدخول
de: Bei Anmeldung starten
es: Iniciar al iniciar sesión
ru: Запускать при входе
zh_hans: 登录时启动

source: Linguistic Analysis
ar: التحليل اللغوي
de: Sprachanalyse
es: Análisis lingüístico
ru: Лингвистический анализ
zh_hans: 语言分析

source: Loading languages...
ar: جاري تحميل اللغات…
de: Sprachen werden geladen...
es: Cargando idiomas...
ru: Загрузка языков…
zh_hans: 正在加载语言...

source: Manage Tags
ar: إدارة التصنيفات
de: Tags verwalten
es: Gestionar etiquetas
ru: Управление тегами
zh_hans: 管理标签

source: Named Entities
ar: الكيانات المسماة
de: Benannte Entitäten
es: Entidades nombradas
ru: Именованные сущности
zh_hans: 专有名词

source: No alternatives available
ar: لا توجد بدائل متاحة
de: Keine alternativen Übersetzungen verfügbar
es: No hay traducciones alternativas disponibles
ru: Нет доступных альтернатив
zh_hans: 无备选翻译可用

source: No cultural notes available
ar: لا توجد ملاحظات ثقافية متاحة
de: Keine kulturellen Hinweise verfügbar
es: No hay notas culturales disponibles
ru: Нет доступных культурных заметок
zh_hans: 无可用文化说明

source: No examples available
ar: لا توجد أمثلة متاحة
de: Keine Beispiele verfügbar
es: No hay ejemplos disponibles
ru: Нет доступных примеров
zh_hans: 无可用示例

source: No favorites yet
ar: لا توجد مفضلات بعد
de: Noch keine Favoriten
es: Aún no hay favoritos
ru: Пока нет избранного
zh_hans: 暂无收藏

source: No results found
ar: لا توجد نتائج
de: Keine Ergebnisse gefunden
es: No se encontraron resultados
ru: Результаты не найдены
zh_hans: 未找到结果

source: No Tags
ar: لا توجد تصنيفات
de: Keine Tags
es: Sin etiquetas
ru: Нет тегов
zh_hans: 无标签

source: No Tags Available
ar: لا تتوفر تصنيفات
de: Keine Tags verfügbar
es: No hay etiquetas disponibles
ru: Нет доступных тегов
zh_hans: 无可用标签

source: No translation history
ar: لا يوجد سجل ترجمة
de: Kein Übersetzungsverlauf
es: Sin historial de traducciones
ru: Нет истории переводов
zh_hans: 无翻译历史

source: No translations match "%@"
ar: لا توجد ترجمات تطابق "%@"
de: Keine Übersetzungen entsprechen "%@"
es: No hay traducciones que coincidan con "%@"
ru: Нет переводов, соответствующих «%@»
zh_hans: 没有匹配 "%@" 的翻译

source: Open app settings
ar: فتح إعدادات التطبيق
de: App-Einstellungen öffnen
es: Abrir configuración de la app
ru: Открыть настройки приложения
zh_hans: 打开应用设置

source: Parts of Speech
ar: أقسام الكلام
de: Wortarten
es: Partes de la oración
ru: Части речи
zh_hans: 词性

source: Preview
ar: المعاينة
de: Vorschau
es: Vista previa
ru: Предпросмотр
zh_hans: 预览

source: Privacy
ar: الخصوصية
de: Datenschutz
es: Privacidad
ru: Конфиденциальность
zh_hans: 隐私

source: Ready to translate
ar: مستعد للترجمة
de: Bereit zum Übersetzen
es: Listo para traducir
ru: Готово к переводу
zh_hans: 准备翻译

source: Recognizing text...
ar: جاري التعرف على النص…
de: Text wird erkannt...
es: Reconociendo texto...
ru: Распознавание текста…
zh_hans: 正在识别文本...

source: Reduce Motion
ar: تقليل الحركة
de: Bewegung reduzieren
es: Reducir movimiento
ru: Уменьшение движения
zh_hans: 减弱动态效果

source: Remove from favorites
ar: إلغاء التفضيل
de: Aus Favoriten entfernen
es: Quitar de favoritos
ru: Убрать из избранного
zh_hans: 从收藏中移除

source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
ru: Повторить
zh_hans: 重试

source: Romanization
ar: الرومنة
de: Romanisierung
es: Romanización
ru: Романизация
zh_hans: 罗马拼音

source: Search translations
ar: البحث عن الترجمات
de: Übersetzungen suchen
es: Buscar traducciones
ru: Поиск переводов
zh_hans: 搜索翻译

source: Select language
ar: اختر اللغة
de: Sprache auswählen
es: Seleccionar idioma
ru: Выберите язык
zh_hans: 选择语言

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
ru: Настройки
zh_hans: 设置

source: Source Code
ar: الكود
de: Quellcode
es: Código fuente
ru: Исходный код
zh_hans: 源代码

source: Speak source
ar: نطق المصدر
de: Quelle sprechen
es: Hablar origen
ru: Озвучить исходный текст
zh_hans: 朗读原文

source: Speak source text
ar: نطق نص المصدر
de: Quelltext sprechen
es: Hablar texto de origen
ru: Озвучить исходный текст
zh_hans: 朗读原文文本

source: Speak translation
ar: نطق الترجمة
de: Übersetzung sprechen
es: Hablar traducción
ru: Озвучить перевод
zh_hans: 朗读翻译

source: Speech Rate
ar: سرعة النطق
de: Sprechgeschwindigkeit
es: Velocidad de habla
ru: Скорость речи
zh_hans: 语速

source: Start voice input
ar: بدء الإدخال الصوتي
de: Spracheingabe starten
es: Iniciar entrada de voz
ru: Начать голосовой ввод
zh_hans: 开始语音输入

source: Stop recording
ar: إيقاف التسجيل
de: Aufnahme stoppen
es: Detener grabación
ru: Остановить запись
zh_hans: 停止录音

source: Stop speaking
ar: إيقاف النطق
de: Sprechen stoppen
es: Detener habla
ru: Остановить озвучивание
zh_hans: 停止朗读

source: Swap languages
ar: تبديل اللغات
de: Sprachen tauschen
es: Intercambiar idiomas
ru: Поменять языки местами
zh_hans: 切换语言

source: System
ar: النظام
es: Sistema
ru: Система
zh_hans: 系统

source: System Tag
ar: تصنيف النظام
es: Etiqueta del sistema
ru: Системный тег
zh_hans: 系统标签

source: System tags cannot be deleted. Tags can be created automatically by AI or manually.
ar: لا يمكن حذف تصنيفات النظام. يمكن إنشاء التصنيفات تلقائيًا بواسطة الذكاء الاصطناعي أو يدويًا.
de: System-Tags können nicht gelöscht werden. Tags können automatisch von KI oder manuell erstellt werden.
es: Las etiquetas del sistema no se pueden eliminar. Las etiquetas se pueden crear automáticamente por IA o manualmente.
ru: Системные теги нельзя удалить. Теги можно создавать автоматически с помощью ИИ или вручную.
zh_hans: 系统标签无法删除。标签可以由 AI 自动创建或手动创建。

source: Tag Name
ar: اسم التصنيف
es: Nombre de la etiqueta
ru: Название тега
zh_hans: 标签名称

source: Translate
ar: الترجمة
de: Übersetzen
es: Traducir
ru: Перевод
zh_hans: 翻译

source: Translation
ar: الترجمة
de: Übersetzung
es: Traducción
ru: Перевод
zh_hans: 翻译

source: Translations
ar: الترجمات
de: Übersetzungen
es: Traducciones
ru: Переводы
zh_hans: 翻译

source: Unfavorite
ar: إلغاء التفضيل
de: Aus Favoriten entfernen
es: Quitar de favoritos
ru: Убрать из избранного
zh_hans: 取消收藏

source: Version
ar: الإصدار
es: Versión
ru: Версия
zh_hans: 版本

source: View details
ar: عرض التفاصيل
de: Details anzeigen
es: Ver detalles
ru: Подробнее
zh_hans: 查看详情

source: You have %lld language. Download at least one more to start translating
ar: لديك لغة واحدة. حمّل لغة واحدة أخرى على الأقل لبدء الترجمة
de: Sie haben %lld Sprache. Laden Sie mindestens eine weitere herunter, um mit der Übersetzung zu beginnen
es: Tienes %lld idioma. Descarga al menos uno más para comenzar a traducir
ru: У вас %lld язык. Скачайте ещё как минимум один, чтобы начать перевод
zh_hans: 您已下载 %lld 种语言。至少再下载一种语言以开始翻译

source: You haven't favorited any translations yet
ar: لم تضِف أي ترجمات إلى المفضلة بعد
de: Sie haben noch keine Übersetzungen als Favoriten markiert
es: Aún no has marcado ninguna traducción como favorita
ru: Вы ещё не добавили переводы в избранное
zh_hans: 您还没有收藏任何翻译

source: Your saved translations will appear here
ar: ستظهر ترجماتك المحفوظة هنا
de: Ihre gespeicherten Übersetzungen werden hier angezeigt
es: Tus traducciones guardadas aparecerán aquí
ru: Сохранённые переводы появятся здесь
zh_hans: 您保存的翻译将显示在这里
